In [1]:
%load_ext sql

In [2]:
import os

In [3]:
host = "localhost"
database = "dvdrental"
user = "postgres"
password = os.getenv("SQL_PASSWORD")

In [4]:
conn_string = f"postgresql://{user}:{password}@{host}/{database}"

In [8]:
conn_string

'postgresql://postgres:nimishanooti@localhost/dvdrental'

In [5]:
%sql $conn_string

In [7]:
'''Question 1 : Return the customer IDs of customers who have spent at least $11 with the staff member who has an ID of 2.'''

'Question 1 : Return the customer IDs of customers who have spent at least $110 with the staff member who has an ID of 2.'

In [14]:
%%sql

SELECT customer_id, staff_id, amount FROM payment
WHERE amount >= 11 AND staff_id = 2

 * postgresql://postgres:***@localhost/dvdrental
6 rows affected.

[(204, 2, Decimal('11.99')),
 (116, 2, Decimal('11.99')),
 (195, 2, Decimal('11.99')),
 (237, 2, Decimal('11.99')),
 (591, 2, Decimal('11.99')),
 (13, 2, Decimal('11.99'))]

In [15]:
%%sql

SELECT COUNT(customer_id) FROM payment
WHERE amount >= 11 AND staff_id = 2

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(6,)]

In [ ]:
'''How many films begin with the letter J?'''

In [17]:
%%sql

SELECT COUNT(title) FROM film
WHERE title LIKE 'J%'

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(20,)]

In [ ]:
'''Question 3 : What customer has the highest customer ID number whose name starts with an 'E' and has an address ID lower than 500?'''

In [18]:
%%sql

SELECT customer_id, first_name, address_id FROM customer
WHERE address_id < 500 AND first_name LIKE 'E%'
ORDER BY customer_id DESC

 * postgresql://postgres:***@localhost/dvdrental
25 rows affected.

[(434, 'Eddie', 439),
 (432, 'Edwin', 437),
 (396, 'Earl', 401),
 (384, 'Ernest', 389),
 (378, 'Eugene', 383),
 (331, 'Eric', 336),
 (317, 'Edward', 322),
 (298, 'Erika', 303),
 (210, 'Ella', 214),
 (205, 'Eileen', 209),
 (198, 'Elsie', 202),
 (169, 'Erica', 173),
 (160, 'Erin', 164),
 (148, 'Eleanor', 152),
 (140, 'Eva', 144),
 (134, 'Emma', 138),
 (132, 'Esther', 136),
 (127, 'Elaine', 131),
 (126, 'Ellen', 130),
 (125, 'Ethel', 129),
 (117, 'Edith', 121),
 (109, 'Edna', 113),
 (99, 'Emily', 103),
 (57, 'Evelyn', 61),
 (5, 'Elizabeth', 9)]

In [19]:
%%sql

SELECT MAX(customer_id) FROM customer
WHERE address_id < 500 AND first_name LIKE 'E%'

 * postgresql://postgres:***@localhost/dvdrental
1 rows affected.

[(434,)]